Hello @ReaNAiveD 
What's strange?

The VMSS was created with 0 instance count. And then we added some machines inside by creating them.
We did not use manual (or automatic) scaling.  
In fact it was existing machines (that were not in a scaleset) we had to recreate with the existing disks/nic so that they end up in the scaleset.  
We do that for max spreading and ability to do capacity reservation in Azure Site Recovery.

The vmss is created through terraform 1.4.6 with azurerm provider 3.75.0  
Basically here is the output of the `terraform plan`:

```
17:30:45    # module.vmss_new["pt-az3"].azurerm_orchestrated_virtual_machine_scale_set.orchestrated_vmss[0] will be created
17:30:45    + resource "azurerm_orchestrated_virtual_machine_scale_set" "orchestrated_vmss" {
17:30:45        + extension_operations_enabled  = (known after apply)
17:30:45        + extensions_time_budget        = "PT1H30M"
17:30:45        + id                            = (known after apply)
17:30:45        + instances                     = 0
17:30:45        + location                      = "francecentral"
17:30:45        + max_bid_price                 = -1
17:30:45        + name                          = (known after apply)
17:30:45        + platform_fault_domain_count   = 1
17:30:45        + priority                      = "Regular"
17:30:45        + resource_group_name           = "pr-asr-pgs-prd"
17:30:45        + single_placement_group        = false
17:30:45        + tags                          = {
17:30:45            + "app-name"             = "pgs"
17:30:45            + "atemi"                = "4848"
17:30:45            + "autoshutdownschedule" = "noautoshutdown"
17:30:45            + "build-tool"           = "iac"
17:30:45            + "build_info_demande"   = ""
17:30:45            + "build_info_eul"       = ""
17:30:45            + "builder"              = "sco"
17:30:45            + "criticality"          = "standard"
17:30:45            + "data-classification"  = "c3"
17:30:45            + "datadog-monitored"    = "no"
17:30:45            + "disablestartandstop"  = "none"
17:30:45            + "environment"          = "prd"
17:30:45            + "expo"                 = "prv"
17:30:45            + "owner"                = "dea"
17:30:45            + "routing-hypervision"  = "none"
17:30:45          }
17:30:45        + unique_id                     = (known after apply)
17:30:45        + zone_balance                  = false
17:30:45        + zones                         = [
17:30:45            + "3",
17:30:45          ]
17:30:45  
17:30:45        + source_image_reference {
17:30:45            + offer     = "WindowsServer"
17:30:45            + publisher = "MicrosoftWindowsServer"
17:30:45            + sku       = "2019-Datacenter"
17:30:45            + version   = "latest"
17:30:45          }
17:30:45      }
17:30:45 
```